/*Напишите программу, которая принимает на вход целое число 
из отрезка [10, 99] и показывает наибольшую цифру числа.
*/
/*
int number = new Random().Next(10, 100);
System.Console.WriteLine(number);

int first = number / 10;
int second = number % 10;
int max = first;

if (second > first)
{
    max = second;
}
System.Console.WriteLine(max);


if(first > second)
{ 
   System.Console.WriteLine(first); 
}
else
{
     System.Console.WriteLine(second);
}
*/
/*
Напишите программу, которая принимает 
на вход число и проверяет, кратно ли оно одновременно 7 и 23.
*/
/*
System.Console.WriteLine("Вводим число: ");
int number = Convert.ToInt32(Console.ReadLine());
if (number % 7 ==0 && number % 23 == 0)
{
    System.Console.WriteLine("Correct");
}
else
{
    System.Console.WriteLine("Incorrect");
}
*/
/* Напишите программу, которая на вход принимает натуральное число N,
 а на выходе показывает его цифры через запятую. */

System.Console.WriteLine("Вводим число: ");
Convert.ToInt32(Console.ReadLine());
